In [48]:
import pandas as pd
import seaborn as sns

print(pd.__version__)
print(sns.__version__)

2.2.2
0.13.2

In [49]:
iris = sns.load_dataset("iris")
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [50]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [51]:
iris.tail(6)

     sepal_length  sepal_width  petal_length  petal_width    species
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [52]:
iris.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [53]:
iris.shape

(150, 5)

In [54]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [55]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [56]:
iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [57]:
type(iris['species'].value_counts())

pandas.core.series.Series

- series 데이터 타입 :
  
https://pandas.pydata.org/docs/reference/api/pandas.Series.html

In [58]:
iris['species'].value_counts().index

Index(['setosa', 'versicolor', 'virginica'], dtype='object', name='species')

In [59]:
iris['species'].value_counts().array

<NumpyExtensionArray>
[np.int64(50), np.int64(50), np.int64(50)]
Length: 3, dtype: int64

In [60]:
iris['species'].value_counts().size

3

In [61]:
iris['species'].value_counts().T

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [62]:
iris['species'].value_counts().memory_usage()

48

In [63]:
df = iris.drop("species", axis=1)
df

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [64]:
iris.shape, df.shape

((150, 5), (150, 4))

In [65]:
df2 = iris.drop(['sepal_length','sepal_width'], axis=1)
df2.head(2)

   petal_length  petal_width species
0           1.4          0.2  setosa
1           1.4          0.2  setosa

In [66]:
iris.shape, df.shape, df2.shape

((150, 5), (150, 4), (150, 3))

In [67]:
df3 = iris.drop([0, 1, 2], axis=0).reset_index(drop=True) #행추출 하고 나서 마무리
df3.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           4.6          3.1           1.5          0.2  setosa
1           5.0          3.6           1.4          0.2  setosa
2           5.4          3.9           1.7          0.4  setosa
3           4.6          3.4           1.4          0.3  setosa
4           5.0          3.4           1.5          0.2  setosa

In [68]:
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2

In [69]:
df.head(5)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [70]:
iris.shape, df.shape, df2.shape, df3.shape

((150, 5), (150, 4), (150, 3), (147, 5))

# 파일 입출력
## 파일 내보내기

In [71]:
iris.to_csv("iris.csv")

In [72]:
iris.to_csv("iris2.csv", index=False)

In [74]:
iris.to_csv("./test_data/iris2.csv", index=False) #경로지정

## 파일 불러오기

In [76]:
iris_df = pd.read_csv("./test_data/iris2.csv")
iris_df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [84]:
DATA_PATH = './kaggle/playground-series-s4e7/train.csv'

train = pd.read_csv(DATA_PATH)
train.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

In [85]:
DATA_PATH = './kaggle/playground-series-s4e7/'

train = pd.read_csv(DATA_PATH + 'train.csv')
train.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0

In [86]:
submission = pd.read_csv(DATA_PATH + 'sample_submission.csv')
submission.head(1)

         id  Response
0  11504798       0.5

## iloc vs loc 차이
- 강사 왈 : 일단은 loc만 기억하자!! (이유 : 직관적임)

In [90]:
# iris.loc[행, 열]
iris.loc[:, ['sepal_length', 'species']].head(1)

   sepal_length species
0           5.1  setosa

In [91]:
cols = ['sepal_length', 'species']
iris.loc[:, cols].head(1)

   sepal_length species
0           5.1  setosa

In [92]:
cols = ['sepal_length', 'species']
iris.loc[iris['sepal_length'] >= 7.5, cols]

     sepal_length    species
105           7.6  virginica
117           7.7  virginica
118           7.7  virginica
122           7.7  virginica
131           7.9  virginica
135           7.7  virginica

In [105]:
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [97]:
cols = ['sepal_width', 'petal_width']
iris.loc[iris['sepal_width'] >= 3.7, cols]

     sepal_width  petal_width
5            3.9          0.4
10           3.7          0.2
14           4.0          0.2
15           4.4          0.4
16           3.9          0.4
18           3.8          0.3
19           3.8          0.3
21           3.7          0.4
32           4.1          0.1
33           4.2          0.2
44           3.8          0.4
46           3.8          0.2
48           3.7          0.2
117          3.8          2.2
131          3.8          2.0

In [104]:
cols = ['sepal_width', 'petal_width', 'petal_length']
iris.loc[iris['petal_width'] <= 0.1, cols]

    sepal_width  petal_width  petal_length
9           3.1          0.1           1.5
12          3.0          0.1           1.4
13          3.0          0.1           1.1
32          4.1          0.1           1.5
37          3.6          0.1           1.4

### 문제1.
-petal_length가 1.7이상인 값을 조회하고, 필드명은 sepal_width, petal_length만 추출하세요

In [109]:
cols = ['sepal_width', 'petal_length']
#iris.loc[행, 열]
result = iris.loc[iris['petal_length'] >= 1.7, cols].reset_index(drop=True)
result

     sepal_width  petal_length
0            3.9           1.7
1            3.8           1.7
2            3.4           1.7
3            3.3           1.7
4            3.4           1.9
..           ...           ...
101          3.0           5.2
102          2.5           5.0
103          3.0           5.2
104          3.4           5.4
105          3.0           5.1

[106 rows x 2 columns]

## 다중조건
- AND 연산자 : 교집합, &
- OR 연산자 : 합집합 |

cols = ['sepal_width', 'petal_length']
#iris.loc[행, 열]
result = iris.loc[(조건1) & (조건2), cols].reset_index(drop=True)
result

In [116]:
cols = ['sepal_width', 'petal_length']
result = iris.loc[(iris['species'] == 'setosa') & (iris['sepal_length'] <= 5.1), cols].reset_index(drop=True)
result.shape

(36, 2)

In [117]:
result1 = iris.loc[iris['species'] == 'setosa']
result2 = result1.loc[iris['sepal_length'] <= 5.1]
result2.shape

(36, 5)

In [118]:
train.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0
1,1,Male,43,1,28.0,0,> 2 Years,Yes,58911.0,26.0,288,1
2,2,Female,25,1,14.0,1,< 1 Year,No,38043.0,152.0,254,0
3,3,Female,35,1,1.0,0,1-2 Year,Yes,2630.0,156.0,76,0
4,4,Female,36,1,15.0,1,1-2 Year,No,31951.0,152.0,294,0

### 테스트 1.
- Gender가 Male인 것만 조회하고, 전체 행의 갯수는?

In [126]:
#train.loc[행, 열]
#이것부터 해보기 train.loc[:, :].head(1) 해서 나오나 먼저 확인 이게 시작 코드임
train.loc[train['Gender'] == 'Male', :].shape

(6228134, 12)

In [127]:
type(train.loc[train['Gender'] == 'Male', :].shape)

tuple

In [130]:
# 데이터프레임 => tuple => int
# 데이터가 어떻게 흘러가는지 중간중간 흐름 잘봐야함
train.loc[train['Gender'] == 'Male', :].shape[0]

6228134

## 문제 2.

In [132]:
train['Vehicle_Age'].value_counts()

#Aehicle_Age가 1-2 Year과 < 1 Year만 추출
#isin() 연산자 활용

Vehicle_Age
1-2 Year     5982678
< 1 Year     5044145
> 2 Years     477975
Name: count, dtype: int64

In [141]:
Vehicle_Age_Values = ['1-2 Year', '< 1 Year']
train.loc[train['Vehicle_Age'].isin(Vehicle_Age_Values), :].head(5)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,0,Male,21,1,35.0,0,1-2 Year,Yes,65101.0,124.0,187,0
2,2,Female,25,1,14.0,1,< 1 Year,No,38043.0,152.0,254,0
3,3,Female,35,1,1.0,0,1-2 Year,Yes,2630.0,156.0,76,0
4,4,Female,36,1,15.0,1,1-2 Year,No,31951.0,152.0,294,0
5,5,Female,31,1,47.0,1,< 1 Year,No,28150.0,152.0,197,0

In [144]:
train.loc[train['Vehicle_Age'].isin(Vehicle_Age_Values), ['Previously_Insured', 'Annual_Premium']].head(5)

   Previously_Insured  Annual_Premium
0                   0         65101.0
2                   1         38043.0
3                   0          2630.0
4                   1         31951.0
5                   1         28150.0

In [147]:
DATA_PATH = './kaggle/playground-series-s4e7/test.csv'

test = pd.read_csv(DATA_PATH)
test.head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228

In [156]:
test.loc[test['Gender'] == 'Female', :].head(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage
0,11504798,Female,20,1,47.0,0,< 1 Year,No,2630.0,160.0,228